[
    {
        "Patient_ID": "Madelyn Long",
        "Metadata": {
            "Age": 61,
            "Gender": "Non-Binary",
            "Ethnicity": "Other",
            "Marital_Status": "Married",
            "Occupation_Category": "Desk Job",
            "Job_Title": "Software Developer",
            "Weight_Current_Kg": 86,
            "Weight_Lowest_Kg": 86,
            "Weight_Highest_Kg": 87,
            "Weight_Status": "going up",
            "BMI_Category": "Overweight",
            "Previous_Hernia_Repairs": [
                {
                    "Year": 1995,
                    "Hospital": "Private Clinic, Sheffield",
                    "Type": "Open Repair",
                    "Mesh_Used": "Yes",
                    "Wound_Breakdown": "No",
                    "Healing_Time": null
                }
            ],
            "Medical_History": {
                "Prior_Major_Surgeries": [],
                "Diabetes": "Yes (Metformin)",
                "Smoking_Status": "No (former smoker, quit 23 years ago)",
                "High_Blood_Pressure": "Yes",
                "Thyroid_Disease": "Yes",
                "Kidney_Disease": "No",
                "Heart_Disease_History": "No",
                "Asthma_COPD": "No",
                "Sleep_Apnoea": "No",
                "Arthritis": "No",
                "Neurological_Disorder": "No",
                "Immunosuppressed": "No",
                "Cancer_History": "No",
                "Alcohol_Consumption": "Moderate",
                "Abdominal_Wound_Infections_Past": "No",
                "Serious_Infection_History": "No",
                "Stoma": "No",
                "Able_to_lie_flat_comfortably": "Yes"
            },
            "Medications": {
                "Metformin": "1g, twice a day",
                "Lisinopril": "5-10mg, once a day",
                "Levothyroxine": "25-100mcg, once a day"
            },
            "QoL_Areas_Affected": [
                "Mental Health",
                "Symptoms",
                "Body Image",
                "Employment",
                "Relationships (social and sexual)"
            ]
        },
        "Narratives": {
            "Symptoms_Restrictions_Activities": "\"Honestly, this hernia is a real pain, and it's impacting me more than I thought it would. It's not just a little bulge; it's a constant reminder that something's not right. Sitting at my computer all day as a Software Developer, I get this dragging ache, especially towards the end of the workday. I try to take breaks and walk around, but even a short walk now can trigger a throbbing pain.\n\nWhat really gets to me is how it's affecting my life outside of work. I used to enjoy gardening, but now bending over to weed or plant something sends a sharp pain through my abdomen. And I'm not as active with my grandkids as I'd like to be. Lifting them is completely out of the question, and even chasing them around the park brings on this uncomfortable pressure. My previous repair lasted for so long, so this time round I was hoping to be much more comfortable in older age than I am currently feeling.\"\n",
            "Symptoms_Adaptations_Face": "\"Ugh, this hernia... it's more than just a bulge, you know? It's taken over my life. I used to love coding at my standing desk all day, but now I have to sit most of the time because standing for too long makes it ache. I've bought these compression shorts – they're not exactly comfortable, especially in summer, but they give me some support and make me feel a little more secure. Socially, things have changed too. I used to be quite active with my friends, going for hikes, but now I mostly just suggest meeting for coffee. Sex? That's... well, let's just say it's become more complicated and less frequent. It's embarrassing, but I'm just not as confident anymore. And mentally, I'm a mess. I'm constantly worried about it getting worse, and it’s hard to concentrate on work. I even started seeing a therapist to help me deal with it all.\"\n",
            "Symptoms_Affect_Movement": "Okay, here's a patient narrative, as a direct quote, describing how the hernia affects their general movement, based on the provided information:\n\n\"Honestly, this hernia is a real pain, literally. It's like a constant nagging feeling, a 'something's not right' kind of sensation. Bending over is the worst. If I have to pick something up from the floor, I have to be *so* careful and bend at the knees, keeping my back straight, because otherwise, I get this sharp jolt, like something's tearing. Twisting is also a no-go. Even just turning to reach for something on the desk at work can trigger a pulling sensation.\n\nStanding up, especially after sitting for a while, is rough. It feels really stiff, and I have to brace myself. Getting out of bed in the morning? Forget about it being graceful. I have to roll onto my side first and then slowly push myself up, otherwise, I feel like I'm going to rip something open.\n\nWalking... walking is okay, most of the time, but if I walk too far or too fast, I start to feel this heavy, dragging feeling. It's just this constant awareness that something's there, bulging, and fragile. It makes me really self-conscious about how I move, too. Like I'm constantly trying to protect it.\"\n",
            "Symptoms_Pain_Coping": "\"Honestly, it's a daily struggle. The discomfort is always there, like a dull ache. Some days are worse than others. When it really flares up, I'll take some paracetamol – that usually takes the edge off. I try not to rely on it too much though. I spend a lot of time at my computer for work, and I've had to adjust my chair and posture constantly, trying to find a position that puts less pressure on the hernia. Sometimes, if I can feel it bulging, I can gently push it back in, which gives me some relief. I also find that taking frequent breaks, just getting up and moving around a bit, helps to stop it from getting too aggravated. And I know it sounds silly, but sometimes just consciously focusing on my breathing, taking slow, deep breaths, seems to calm things down a little.\"\n",
            "BodyImage_SelfConscious_Embarrassed": "\"Honestly, I hate how this hernia makes me look. It's just...there. This bulge sticking out, especially on one side, makes me feel so asymmetrical and disfigured. I try to hide it with baggy clothes, but then I just feel like I'm hiding something. After my first surgery, I thought it would all be over, but this new one...it just feels even more prominent. It ruins my figure, and even though I know it sounds silly, sometimes I feel like I look pregnant. It's embarrassing, and it makes me so ashamed of my body.\"\n",
            "BodyImage_Others_Noticing": "\"It's hard to explain, but yeah, I definitely feel like people notice it. I've caught a few awkward glances, like they're trying to figure out what they're seeing. And once, someone actually asked if I was pregnant! I know they probably didn't mean anything by it, but it was so… humiliating. It just makes me feel so self-conscious and embarrassed to be seen. I hate the feeling of being scrutinized and I sometimes want to just shrink away and disappear.\"\n",
            "MentalHealth_Affected_Elaborate": "\"It’s just… this hernia. It's always *there*, a constant reminder. I feel… trapped, honestly. Like my own body is betraying me. I find myself getting so irritable, snapping at my partner for the smallest things, then feeling guilty afterwards, which just makes everything worse. I used to really enjoy coding, it was my escape, but now, even sitting at the computer feels like a chore. I can't concentrate. The pain, the awareness of it… it's just a constant low hum of anxiety. I feel so… low. I know it sounds dramatic, but some days, I just feel a sense of dread wash over me for no reason. I keep thinking about that first surgery, the mesh… and what if this one doesn’t work either? What if I'm just stuck like this? It messes with my head, you know? Makes me feel… less like myself. It’s hard to explain, but it’s taken away so much of my joy. I hate looking at myself in the mirror. This isn’t me.\"\n",
            "MentalHealth_Coping_Strategies": "\"Honestly, the hernia just messes with my head. Some days are okay, but other days... I find myself just withdrawing. I used to love going out with friends, but lately, I've been canceling a lot. People mean well, but they always ask about it, and then I'm stuck thinking about it constantly. I try to distract myself, you know? Dive into work, get lost in a video game. Sometimes, it helps. Other times, I end up doom-scrolling online, looking for answers, and that just makes the anxiety worse. I definitely get more irritable too; my partner has noticed. I hate feeling like a burden, so I try to hide it, but it's hard. I did talk to my sister about it once, and that helped a little, but mostly, I just try to ignore it and hope it goes away, even though I know it won't.\"\n",
            "Relationships_Social_Affected": "\"It's… complicated. Socially, I mean. Before the hernia really flared up, I used to be a lot more active. I'm part of a board game group, and honestly, carrying the game bag and sitting for hours hunched over the table has become a real struggle. I've had to drop out of coordinating the weekly game night, which I really enjoyed.\n\nAnd then there's… well, intimacy. The pain and just the way I feel about my body now makes it really hard to be close to people. It’s like I'm constantly aware of it, and it gets in the way, both physically and mentally. It’s strained my relationship with my partner, and honestly, I worry about becoming a burden. I used to enjoy going out dancing or to concerts, but now, the thought of being in a crowded space, moving around, is just… exhausting. I end up staying home more, and I feel like I'm slowly fading out of my friends' lives. It’s isolating, to be honest. I used to feel so connected, and now… I just feel like I'm watching from the sidelines.\"\n",
            "Relationships_Intimate_Affected": "\"It's hard to talk about, but this hernia… it’s really messed with my relationship. I feel so awkward about it. Sex isn't enjoyable like it used to be, there's just constant discomfort that makes me hesitant. I worry constantly about how it looks, how it feels to my partner. I feel less desirable, honestly. There’s this constant strain on the relationship now, and it breaks my heart. I feel guilty that I can't be as spontaneous or intimate as I used to be. It’s like this constant reminder of my body and its limitations, and it’s just… it's hard to connect emotionally when I'm so self-conscious and physically uncomfortable.\"\n",
            "Employment_What_Do_You_Do": "\"I work as a Software Developer, sitting at a desk most of the day.\"\n",
            "Employment_Ability_To_Work_Affected": "\"Being a software developer, you wouldn't think a hernia would be a big deal. But honestly, the discomfort and anxiety are really impacting my work. It’s hard to concentrate when I'm constantly aware of the bulge in my abdomen. Some days, the pain makes it difficult to sit comfortably for extended periods, which is obviously a problem when you're coding all day. And it's not just the physical discomfort; it's the mental toll of knowing I had this fixed once before and it's back. That's affecting my focus and productivity, and honestly, my confidence in my ability to do my job properly.\"\n",
            "Employment_Changed_Work": "\"I'm a software developer, so it's not like I'm doing heavy lifting, but honestly, this hernia's been messing with my concentration. I haven't changed jobs or anything, but I'm finding it harder to focus for long stretches. I'm starting to wonder if I'll eventually need to cut back on my hours, or maybe even look at a different type of role with less pressure, but I'm not quite there yet.\"\n",
            "Employment_Financial_Affected": "\"Financially, this hernia is a real pain. I'm a software developer, and focusing is hard with the discomfort. That's led to reduced productivity and honestly, I'm worried about getting less work and potentially reduced pay. The travel for all these appointments is adding up too. And the thought of potential complications down the line, and the medical bills that could come with that... it's definitely creating some financial anxiety for the future.\"\n",
            "SharedDecisionMaking_Questions": "\"Okay, so, given my age and that I'm managing diabetes and high blood pressure, what are the biggest risks I should be aware of with this surgery specifically? I had a hernia repair before, back in '95, and I'm worried about recurrence. What are the chances of it coming back this time, and what kind of mesh are you planning to use? Also, being a software developer, I need to be able to sit at a desk comfortably. How long am I looking at before I can realistically get back to work, and what can I expect in terms of long-term pain management? Finally, I'm also self-conscious about how this looks. Is there anything that can be done to minimize scarring?\"\n",
            "SharedDecisionMaking_Hopes": "\"Honestly, this hernia is really getting me down. It's not just the discomfort, which is bad enough, but it's affecting my whole life. I'm self-conscious about my body image, which is hitting my mental health hard. I’m finding it hard to focus at work as a software developer, and I’m snapping at my partner. I'm even avoiding social situations. It's impacting my relationships, both the social and, well, the more intimate side of things. I know I had a repair done years ago, but I'm really hoping this surgery will finally give me lasting relief from the pain and discomfort. More than anything, I want to feel comfortable in my own skin again, to feel good about myself, to be able to focus on my work and rebuild those connections with the people I care about. I want to be able to get back to normal, enjoy life to the fullest, and not let this hernia control me.\"\n",
            "SharedDecisionMaking_Matters_To_You": "\"Honestly, this hernia...it's just sucking the joy out of everything. I'm a software developer, and I need to be able to focus. The discomfort is a constant distraction, affecting my concentration and productivity. It also impacts my mental health. I feel so much more irritable and down lately. I used to love hiking on the weekends, but now even a short walk leaves me exhausted. My biggest fear is not being able to stay active. More than anything, I want to feel comfortable in my own body again and get back to enjoying life. I want to be able to take my grandkids to the park without worrying about the pain, and feel like myself again. This is really affecting my sense of self.\"\n"
        }
    },
    {
        "Patient_ID": "Madelyn Long",
        "Metadata": {
            "Age": 61,
            "Gender": "Non-Binary",
            "Ethnicity": "Other",
            "Marital_Status": "Married",
            "Occupation_Category": "Desk Job",
            "Job_Title": "Software Developer",
            "Weight_Current_Kg": 86,
            "Weight_Lowest_Kg": 86,
            "Weight_Highest_Kg": 87,
            "Weight_Status": "going up",
            "BMI_Category": "Overweight",
            "Previous_Hernia_Repairs": [
                {
                    "Year": 1995,
                    "Hospital": "Private Clinic, Sheffield",
                    "Type": "Open Repair",
                    "Mesh_Used": "Yes",
                    "Wound_Breakdown": "No",
                    "Healing_Time": null
                }
            ],
            "Medical_History": {
                "Prior_Major_Surgeries": [],
                "Diabetes": "Yes (Metformin)",
                "Smoking_Status": "No (former smoker, quit 23 years ago)",
                "High_Blood_Pressure": "Yes",
                "Thyroid_Disease": "Yes",
                "Kidney_Disease": "No",
                "Heart_Disease_History": "No",
                "Asthma_COPD": "No",
                "Sleep_Apnoea": "No",
                "Arthritis": "No",
                "Neurological_Disorder": "No",
                "Immunosuppressed": "No",
                "Cancer_History": "No",
                "Alcohol_Consumption": "Moderate",
                "Abdominal_Wound_Infections_Past": "No",
                "Serious_Infection_History": "No",
                "Stoma": "No",
                "Able_to_lie_flat_comfortably": "Yes"
            },
            "Medications": {
                "Metformin": "1g, twice a day",
                "Lisinopril": "5-10mg, once a day",
                "Levothyroxine": "25-100mcg, once a day"
            },
            "QoL_Areas_Affected": [
                "Mental Health",
                "Symptoms",
                "Body Image",
                "Employment",
                "Relationships (social and sexual)"
            ]
        },
        "Narratives": {
            "Symptoms_Restrictions_Activities": "\"Honestly, this hernia is a real pain, and it's impacting me more than I thought it would. It's not just a little bulge; it's a constant reminder that something's not right. Sitting at my computer all day as a Software Developer, I get this dragging ache, especially towards the end of the workday. I try to take breaks and walk around, but even a short walk now can trigger a throbbing pain.\n\nWhat really gets to me is how it's affecting my life outside of work. I used to enjoy gardening, but now bending over to weed or plant something sends a sharp pain through my abdomen. And I'm not as active with my grandkids as I'd like to be. Lifting them is completely out of the question, and even chasing them around the park brings on this uncomfortable pressure. My previous repair lasted for so long, so this time round I was hoping to be much more comfortable in older age than I am currently feeling.\"\n",
            "Symptoms_Adaptations_Face": "\"Ugh, this hernia... it's more than just a bulge, you know? It's taken over my life. I used to love coding at my standing desk all day, but now I have to sit most of the time because standing for too long makes it ache. I've bought these compression shorts – they're not exactly comfortable, especially in summer, but they give me some support and make me feel a little more secure. Socially, things have changed too. I used to be quite active with my friends, going for hikes, but now I mostly just suggest meeting for coffee. Sex? That's... well, let's just say it's become more complicated and less frequent. It's embarrassing, but I'm just not as confident anymore. And mentally, I'm a mess. I'm constantly worried about it getting worse, and it’s hard to concentrate on work. I even started seeing a therapist to help me deal with it all.\"\n",
            "Symptoms_Affect_Movement": "Okay, here's a patient narrative, as a direct quote, describing how the hernia affects their general movement, based on the provided information:\n\n\"Honestly, this hernia is a real pain, literally. It's like a constant nagging feeling, a 'something's not right' kind of sensation. Bending over is the worst. If I have to pick something up from the floor, I have to be *so* careful and bend at the knees, keeping my back straight, because otherwise, I get this sharp jolt, like something's tearing. Twisting is also a no-go. Even just turning to reach for something on the desk at work can trigger a pulling sensation.\n\nStanding up, especially after sitting for a while, is rough. It feels really stiff, and I have to brace myself. Getting out of bed in the morning? Forget about it being graceful. I have to roll onto my side first and then slowly push myself up, otherwise, I feel like I'm going to rip something open.\n\nWalking... walking is okay, most of the time, but if I walk too far or too fast, I start to feel this heavy, dragging feeling. It's just this constant awareness that something's there, bulging, and fragile. It makes me really self-conscious about how I move, too. Like I'm constantly trying to protect it.\"\n",
            "Symptoms_Pain_Coping": "\"Honestly, it's a daily struggle. The discomfort is always there, like a dull ache. Some days are worse than others. When it really flares up, I'll take some paracetamol – that usually takes the edge off. I try not to rely on it too much though. I spend a lot of time at my computer for work, and I've had to adjust my chair and posture constantly, trying to find a position that puts less pressure on the hernia. Sometimes, if I can feel it bulging, I can gently push it back in, which gives me some relief. I also find that taking frequent breaks, just getting up and moving around a bit, helps to stop it from getting too aggravated. And I know it sounds silly, but sometimes just consciously focusing on my breathing, taking slow, deep breaths, seems to calm things down a little.\"\n",
            "BodyImage_SelfConscious_Embarrassed": "\"Honestly, I hate how this hernia makes me look. It's just...there. This bulge sticking out, especially on one side, makes me feel so asymmetrical and disfigured. I try to hide it with baggy clothes, but then I just feel like I'm hiding something. After my first surgery, I thought it would all be over, but this new one...it just feels even more prominent. It ruins my figure, and even though I know it sounds silly, sometimes I feel like I look pregnant. It's embarrassing, and it makes me so ashamed of my body.\"\n",
            "BodyImage_Others_Noticing": "\"It's hard to explain, but yeah, I definitely feel like people notice it. I've caught a few awkward glances, like they're trying to figure out what they're seeing. And once, someone actually asked if I was pregnant! I know they probably didn't mean anything by it, but it was so… humiliating. It just makes me feel so self-conscious and embarrassed to be seen. I hate the feeling of being scrutinized and I sometimes want to just shrink away and disappear.\"\n",
            "MentalHealth_Affected_Elaborate": "\"It’s just… this hernia. It's always *there*, a constant reminder. I feel… trapped, honestly. Like my own body is betraying me. I find myself getting so irritable, snapping at my partner for the smallest things, then feeling guilty afterwards, which just makes everything worse. I used to really enjoy coding, it was my escape, but now, even sitting at the computer feels like a chore. I can't concentrate. The pain, the awareness of it… it's just a constant low hum of anxiety. I feel so… low. I know it sounds dramatic, but some days, I just feel a sense of dread wash over me for no reason. I keep thinking about that first surgery, the mesh… and what if this one doesn’t work either? What if I'm just stuck like this? It messes with my head, you know? Makes me feel… less like myself. It’s hard to explain, but it’s taken away so much of my joy. I hate looking at myself in the mirror. This isn’t me.\"\n",
            "MentalHealth_Coping_Strategies": "\"Honestly, the hernia just messes with my head. Some days are okay, but other days... I find myself just withdrawing. I used to love going out with friends, but lately, I've been canceling a lot. People mean well, but they always ask about it, and then I'm stuck thinking about it constantly. I try to distract myself, you know? Dive into work, get lost in a video game. Sometimes, it helps. Other times, I end up doom-scrolling online, looking for answers, and that just makes the anxiety worse. I definitely get more irritable too; my partner has noticed. I hate feeling like a burden, so I try to hide it, but it's hard. I did talk to my sister about it once, and that helped a little, but mostly, I just try to ignore it and hope it goes away, even though I know it won't.\"\n",
            "Relationships_Social_Affected": "\"It's… complicated. Socially, I mean. Before the hernia really flared up, I used to be a lot more active. I'm part of a board game group, and honestly, carrying the game bag and sitting for hours hunched over the table has become a real struggle. I've had to drop out of coordinating the weekly game night, which I really enjoyed.\n\nAnd then there's… well, intimacy. The pain and just the way I feel about my body now makes it really hard to be close to people. It’s like I'm constantly aware of it, and it gets in the way, both physically and mentally. It’s strained my relationship with my partner, and honestly, I worry about becoming a burden. I used to enjoy going out dancing or to concerts, but now, the thought of being in a crowded space, moving around, is just… exhausting. I end up staying home more, and I feel like I'm slowly fading out of my friends' lives. It’s isolating, to be honest. I used to feel so connected, and now… I just feel like I'm watching from the sidelines.\"\n",
            "Relationships_Intimate_Affected": "\"It's hard to talk about, but this hernia… it’s really messed with my relationship. I feel so awkward about it. Sex isn't enjoyable like it used to be, there's just constant discomfort that makes me hesitant. I worry constantly about how it looks, how it feels to my partner. I feel less desirable, honestly. There’s this constant strain on the relationship now, and it breaks my heart. I feel guilty that I can't be as spontaneous or intimate as I used to be. It’s like this constant reminder of my body and its limitations, and it’s just… it's hard to connect emotionally when I'm so self-conscious and physically uncomfortable.\"\n",
            "Employment_What_Do_You_Do": "\"I work as a Software Developer, sitting at a desk most of the day.\"\n",
            "Employment_Ability_To_Work_Affected": "\"Being a software developer, you wouldn't think a hernia would be a big deal. But honestly, the discomfort and anxiety are really impacting my work. It’s hard to concentrate when I'm constantly aware of the bulge in my abdomen. Some days, the pain makes it difficult to sit comfortably for extended periods, which is obviously a problem when you're coding all day. And it's not just the physical discomfort; it's the mental toll of knowing I had this fixed once before and it's back. That's affecting my focus and productivity, and honestly, my confidence in my ability to do my job properly.\"\n",
            "Employment_Changed_Work": "\"I'm a software developer, so it's not like I'm doing heavy lifting, but honestly, this hernia's been messing with my concentration. I haven't changed jobs or anything, but I'm finding it harder to focus for long stretches. I'm starting to wonder if I'll eventually need to cut back on my hours, or maybe even look at a different type of role with less pressure, but I'm not quite there yet.\"\n",
            "Employment_Financial_Affected": "\"Financially, this hernia is a real pain. I'm a software developer, and focusing is hard with the discomfort. That's led to reduced productivity and honestly, I'm worried about getting less work and potentially reduced pay. The travel for all these appointments is adding up too. And the thought of potential complications down the line, and the medical bills that could come with that... it's definitely creating some financial anxiety for the future.\"\n",
            "SharedDecisionMaking_Questions": "\"Okay, so, given my age and that I'm managing diabetes and high blood pressure, what are the biggest risks I should be aware of with this surgery specifically? I had a hernia repair before, back in '95, and I'm worried about recurrence. What are the chances of it coming back this time, and what kind of mesh are you planning to use? Also, being a software developer, I need to be able to sit at a desk comfortably. How long am I looking at before I can realistically get back to work, and what can I expect in terms of long-term pain management? Finally, I'm also self-conscious about how this looks. Is there anything that can be done to minimize scarring?\"\n",
            "SharedDecisionMaking_Hopes": "\"Honestly, this hernia is really getting me down. It's not just the discomfort, which is bad enough, but it's affecting my whole life. I'm self-conscious about my body image, which is hitting my mental health hard. I’m finding it hard to focus at work as a software developer, and I’m snapping at my partner. I'm even avoiding social situations. It's impacting my relationships, both the social and, well, the more intimate side of things. I know I had a repair done years ago, but I'm really hoping this surgery will finally give me lasting relief from the pain and discomfort. More than anything, I want to feel comfortable in my own skin again, to feel good about myself, to be able to focus on my work and rebuild those connections with the people I care about. I want to be able to get back to normal, enjoy life to the fullest, and not let this hernia control me.\"\n",
            "SharedDecisionMaking_Matters_To_You": "\"Honestly, this hernia...it's just sucking the joy out of everything. I'm a software developer, and I need to be able to focus. The discomfort is a constant distraction, affecting my concentration and productivity. It also impacts my mental health. I feel so much more irritable and down lately. I used to love hiking on the weekends, but now even a short walk leaves me exhausted. My biggest fear is not being able to stay active. More than anything, I want to feel comfortable in my own body again and get back to enjoying life. I want to be able to take my grandkids to the park without worrying about the pain, and feel like myself again. This is really affecting my sense of self.\"\n"
        }  
    }
]

